In [ ]:
# pandas로 예제 데이터 csv만들기
# join하기
# 불필요 컬럼 지우기 (index를 이용해서)

# 2023.8.12
# https://www.youtube.com/watch?v=oMSphIYmlYo

In [5]:
import pandas as pd

In [27]:
# pansdas로 csv파일 쓰기 (dictionary 이용)
df1 = pd.DataFrame({
    "이름": ["송중기", "김나연", "박보검", "권보아", "이효리"], 
    "업체": ["별다방", "콩다방", "별다방", "별다방", "콩다방"], 
    "제품": ["카페라테", "아이스티", "아이스티", "카페라테", "아이스티"], 
                     })

In [28]:
#df1 = pd.read_csv("data1.csv")
df1

    이름   업체    제품
0  송중기  별다방  카페라테
1  김나연  콩다방  아이스티
2  박보검  별다방  아이스티
3  권보아  별다방  카페라테
4  이효리  콩다방  아이스티

In [33]:
df2 = pd.DataFrame({
    "업체": ["별다방", "별다방", "콩다방", "콩다방"], 
    "제품": ["카페라테", "아이스티", "카페라테", "아이스티"], 
    "가격": [4500, 5000, 4200, 4700],     
                     })
#df2 = pd.read_csv("data2.csv")
df2

    업체    제품    가격
0  별다방  카페라테  4500
1  별다방  아이스티  5000
2  콩다방  카페라테  4200
3  콩다방  아이스티  4700

In [34]:
df3 = df1.merge(df2, how="left")

In [37]:
df3.head()

    이름   업체    제품    가격
0  송중기  별다방  카페라테  4500
1  김나연  콩다방  아이스티  4700
2  박보검  별다방  아이스티  5000
3  권보아  별다방  카페라테  4500
4  이효리  콩다방  아이스티  4700

In [38]:
# index로 컬럼 지우기
df4 = df3.drop(df3.columns[3], axis=1)

In [40]:
df4.head()

    이름   업체    제품
0  송중기  별다방  카페라테
1  김나연  콩다방  아이스티
2  박보검  별다방  아이스티
3  권보아  별다방  카페라테
4  이효리  콩다방  아이스티

In [41]:
# csv 파일로 내용 저장하기
df1.to_csv("test1.csv")
df2.to_csv("test2.csv")
df3.to_csv("test3.csv")
df4.to_csv("test4.csv")